Tekla.Structures.Plugins.DirectManipulation.Services.Controls.CheckBoxControl
The Tekla.Structures.Plugins.DirectManipulation.Services.Controls.CheckBoxControl class represents a check box.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.CheckBoxControl.internalControl
The internal control.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.CheckBoxControl.#ctor
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Controls.CheckBoxControl class.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.CheckBoxControl.#ctor(System.String,System.Drawing.Image)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Controls.CheckBoxControl class.
text: The text.
image: The image.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.CheckBoxControl.#ctor(System.String)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Controls.CheckBoxControl class.
text: The text.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.CheckBoxControl.#ctor(System.Drawing.Image)
Initializes a new instance of the Tekla.Structures.Plugins.DirectManipulation.Services.Controls.CheckBoxControl class.
image: The image.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.CheckBoxControl.StateChanged
Event to be called when the state of the control has changed.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.CheckBoxControl.IsChecked
Gets a value indicating whether this control is currently in a checked state.

Tekla.Structures.Plugins.DirectManipulation.Services.Controls.CheckBoxControl.InternalControl


Tekla.Structures.Plugins.DirectManipulation.Services.Controls.CheckBoxControl.Dispose(System.Boolean)


Tekla.Structures.Plugins.DirectManipulation.Services.Controls.CheckBoxControl.OnStateChanged(Tekla.BIM.DirectManipulation.Services.Controls.ControlBase)
Event handler for routing the state changed event.
control: The control.